Tekla.Structures.Analysis.Remoting.CDelegateSynchronized.ExportFetchAnalysisModelIssue(Tekla.Structures.AnalysisInternal.DotAnalysisModelIssue@)
DO NOT USE! For internal usage only!
analysisModelIssue: The analysis model issue.
Returns: Returns TRUE if successfully deleted the analysis model.

Tekla.Structures.Analysis.Remoting.CDelegateSynchronized.ExportQueryAnalysisLoadGroup(Tekla.Structures.AnalysisInternal.DotAnalysisLoadGroupQuery@)
DO NOT USE! For internal usage only!
Returns: Returns TRUE if successfully selected the analysis load group.

Tekla.Structures.Analysis.Remoting.CDelegateSynchronized.ExportUISetSelectedAnalysisObjects(System.Collections.Generic.List{Tekla.Structures.AnalysisInternal.dotADSelectedObject_t},System.Int32)
DO NOT USE! For internal usage only!
objects: The objects.
append: The append selection switch.
Returns: Returns the count of objects selected.

Tekla.Structures.Analysis.Remoting.CDelegateSynchronized.ExportAnalysisObjectOperation(Tekla.Structures.AnalysisInternal.dotAnalysisObjectOperation_t@)
DO NOT USE! For internal usage only!

Tekla.Structures.Analysis.Remoting.CDelegateSynchronized.ExportAnalysisChangeManagementObjectsTimes(Tekla.Structures.AnalysisInternal.DotAnalysisChangeManagementObjectsTimes@)
DO NOT USE! For internal usage only!

Tekla.Structures.Analysis.Remoting.CDelegateSynchronized.ExportAnalysisChangeManagementTime(Tekla.Structures.AnalysisInternal.DotAnalysisChangeManagementTime@)
DO NOT USE! For internal usage only!

Tekla.Structures.Analysis.Remoting.CDelegateSynchronized.ExportAnalysisChangeManagementPartBarData(Tekla.Structures.AnalysisInternal.DotAnalysisChangeManagementPartBarData@)
DO NOT USE! For internal usage only!

Tekla.Structures.Analysis.Remoting.CDelegateSynchronized.ExportAnalysisChangeManagementOperation(Tekla.Structures.AnalysisInternal.DotAnalysisChangeManagementOperation@)
DO NOT USE! For internal usage only!

Tekla.Structures.Analysis.Remoting.CDelegateSynchronized.ExportAnalysisChangeManagementPartDiff(Tekla.Structures.AnalysisInternal.DotAnalysisChangeManagementPartDiff@)
DO NOT USE! For internal usage only!

Tekla.Structures.Analysis.Remoting.CDelegateSynchronized.DotAnalysisExportFetchAnalysisModelIssue(Tekla.Structures.AnalysisInternal.DotAnalysisModelIssue@)
DO NOT USE! For internal usage only!
analysisModelIssue: The analysis model issue.
Returns: Returns TRUE on success.

Tekla.Structures.Analysis.Remoting.CDelegateSynchronized.DotAnalysisExportQueryAnalysisLoadGroup(Tekla.Structures.AnalysisInternal.DotAnalysisLoadGroupQuery@)
DO NOT USE! For internal usage only!
Returns: Returns TRUE on success.

Tekla.Structures.Analysis.Remoting.CDelegateSynchronized.DotAnalysisExportUISetSelectedAnalysisObjects(Tekla.Structures.AnalysisInternal.dotADSelectedObject_t*,System.Int32,System.Int32)
DO NOT USE! For internal usage only!
pObjects: The objects.
nObjects: The object count.
append: The append selection switch.
Returns: Returns TRUE on success.

Tekla.Structures.Analysis.Remoting.CDelegateSynchronized.DotExportAnalysisObjectOperation(Tekla.Structures.AnalysisInternal.dotAnalysisObjectOperation_t@)
DO NOT USE! For internal usage only!

Tekla.Structures.Analysis.Remoting.CDelegateSynchronized.DotExportAnalysisChangeManagementObjectsTimes(Tekla.Structures.AnalysisInternal.DotAnalysisChangeManagementObjectsTimes@)
DO NOT USE! For internal usage only!

Tekla.Structures.Analysis.Remoting.CDelegateSynchronized.DotExportAnalysisChangeManagementTime(Tekla.Structures.AnalysisInternal.DotAnalysisChangeManagementTime@)
DO NOT USE! For internal usage only!

Tekla.Structures.Analysis.Remoting.CDelegateSynchronized.DotExportAnalysisChangeManagementPartBarData(Tekla.Structures.AnalysisInternal.DotAnalysisChangeManagementPartBarData@)
DO NOT USE! For internal usage only!

Tekla.Structures.Analysis.Remoting.CDelegateSynchronized.DotExportAnalysisChangeManagementOperation(Tekla.Structures.AnalysisInternal.DotAnalysisChangeManagementOperation@)
DO NOT USE! For internal usage only!

Tekla.Structures.Analysis.Remoting.CDelegateSynchronized.DotExportAnalysisChangeManagementPartDiff(Tekla.Structures.AnalysisInternal.DotAnalysisChangeManagementPartDiff@)
DO NOT USE! For internal usage only!